tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU database manager
brew "gdbm"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound", link: false
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# GNU grep, egrep and fgrep
brew "grep"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Port scanning utility for large networks
brew "nmap"
# Open source, general-purpose policy engine
brew "opa"
# Tool for creating identical machine images for multiple platforms
brew "packer", link: false
# Tool for managing OCI containers and pods
brew "podman"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Ruby version manager
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"
# Adds basic gemset support to rbenv
brew "rbenv-gemset"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# User interface to the TELNET protocol
brew "telnet"
# Improve Terraform's plan output
brew "terraform_landscape"
# Terraform version manager inspired by rbenv
brew "tfenv", link: false
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# App to build and share containerized applications and microservices
cask "docker"
# Add fira code font
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Developer", id: 640199958
mas "Magnet", id: 441258766
mas "Meeter", id: 1510445899
mas "Slack", id: 803453959
mas "Tadam", id: 531349534
mas "Todoist", id: 585829637
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
